Filtering and Boolean Indexing

In [1]:
import pandas as pd

In [ ]:
data = {
    "Name":["Ammar","Kashif","furqan","Arif"],
    "Age":[25, 32, 22, 28],
    "Salary":[40000, 50000, 60000, 70000],
    "Department":["IT","HR","Finance","IT"]
}
df = pd.DataFrame(data)

     Name  Age  Salary Department
0   Ammar   25   40000         IT
1  Kashif   32   50000         HR
2  furqan   22   60000    Finance
3    Arif   28   70000         IT

In [12]:
#Filter rows where Salary > 50000
salary_con = df[df["Salary"] > 50000]
# Filter rows where Department is IT
dep_con = df[df["Department"] == "IT"]
# Filter rows where Age < 28
age_con = df[df["Age"] < 28]
# Filter specific column after filtering
sp_col_con = df[df["Salary"] > 50000]["Department"]
print(sp_col_con)

2    Finance
3         IT
Name: Department, dtype: object

BOOLEAN INDEXING (Pandas)

Multiple conditions (AND)

In [13]:
multi = df[(df["Department"] == "IT") & (df["Age"] > 20) & (df["Salary"] > 40000)]
print(multi)

   Name  Age  Salary Department
3  Arif   28   70000         IT

Multiple conditions (OR)

In [16]:
df[(df["Department"] == "AI")|(df["Age"] > 20)]

     Name  Age  Salary Department
0   Ammar   25   40000         IT
1  Kashif   32   50000         HR
2  furqan   22   60000    Finance
3    Arif   28   70000         IT

NOT condition

In [21]:
df[~(df["Age"] > 30)&(df["Department"] == "IT")]

    Name  Age  Salary Department
0  Ammar   25   40000         IT
3   Arif   28   70000         IT

Boolean indexing with multiple columns selection

In [24]:
df.loc[df["Salary"] > 50000, ["Name","Salary","Department"]]

     Name  Salary Department
2  furqan   60000    Finance
3    Arif   70000         IT

Real world practice